benchmark/leveldb/results/ratio/mris_ratio_ssd.16.1.log
LevelDB:    version 1.5
Date:       Sun Dec  2 22:39:58 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    1676.480 micros/op;    8.8 MB/s small: 5000/0; big: 313/0
Microseconds per op:
Count: 5313  Average: 1676.5212  StdDev: 1585.95
Min: 0.0000  Median: 1473.6646  Max: 7919.0000
------------------------------------------------------
[       0,       1 )      18   0.339%   0.339% 
[       1,       2 )      54   1.016%   1.355% 
[       2,       3 )     229   4.310%   5.665% #
[       3,       4 )       9   0.169%   5.835% 
[      12,      14 )       1   0.019%   5.854% 
[      20,      25 )      12   0.226%   6.079% 
[      25,      30 )      39   0.734%   6.813% 
[      30,      35 )      77   1.449%   8.263% 
[      35,      40 )     374   7.039%  15.302% #
[      40,      45 )     288   5.421%  20.723% #
[      45,      50 )       7   0.132%  20.855% 
[      50,      60 )      40   0.753%  21.607% 
[      60,      70 )       5   0.094%  21.701% 
[      70,      80 )       2   0.038%  21.739% 
[      80,      90 )      71   1.336%  23.075% 
[      90,     100 )     196   3.689%  26.765% #
[     100,     120 )     186   3.501%  30.265% #
[     120,     140 )      88   1.656%  31.922% 
[     140,     160 )      64   1.205%  33.126% 
[     160,     180 )      31   0.583%  33.710% 
[     180,     200 )      13   0.245%  33.954% 
[     200,     250 )      12   0.226%  34.180% 
[     250,     300 )       1   0.019%  34.199% 
[     400,     450 )       4   0.075%  34.274% 
[     450,     500 )       5   0.094%  34.369% 
[     500,     600 )       7   0.132%  34.500% 
[     600,     700 )       2   0.038%  34.538% 
[     700,     800 )      13   0.245%  34.783% 
[     800,     900 )      43   0.809%  35.592% 
[     900,    1000 )      91   1.713%  37.305% 
[    1000,    1200 )     221   4.160%  41.464% #
[    1200,    1400 )     157   2.955%  44.419% #
[    1400,    1600 )     805  15.152%  59.571% ###
[    1600,    1800 )      62   1.167%  60.738% 
[    1800,    2000 )       8   0.151%  60.888% 
[    2000,    2500 )      48   0.903%  61.792% 
[    2500,    3000 )    1426  26.840%  88.632% #####
[    3000,    3500 )     269   5.063%  93.695% #
[    3500,    4000 )      46   0.866%  94.561% 
[    4000,    4500 )      49   0.922%  95.483% 
[    4500,    5000 )      18   0.339%  95.822% 
[    5000,    6000 )      89   1.675%  97.497% 
[    6000,    7000 )      67   1.261%  98.758% 
[    7000,    8000 )      66   1.242% 100.000% 

----- /mnt/largespace/mris_ratio_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	313
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0