benchmark/leveldb/results/ratio/mris_ratio_ssd.16.3.log
LevelDB:    version 1.5
Date:       Sun Dec  2 22:40:17 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    1676.097 micros/op;    8.8 MB/s small: 5000/0; big: 313/0
Microseconds per op:
Count: 5313  Average: 1676.1336  StdDev: 1586.84
Min: 0.0000  Median: 1474.2331  Max: 8299.0000
------------------------------------------------------
[       0,       1 )      28   0.527%   0.527% 
[       1,       2 )      40   0.753%   1.280% 
[       2,       3 )     219   4.122%   5.402% #
[       3,       4 )      23   0.433%   5.835% 
[       4,       5 )       1   0.019%   5.854% 
[      20,      25 )      13   0.245%   6.098% 
[      25,      30 )      37   0.696%   6.795% 
[      30,      35 )      80   1.506%   8.300% 
[      35,      40 )     369   6.945%  15.246% #
[      40,      45 )     294   5.534%  20.779% #
[      45,      50 )      13   0.245%  21.024% 
[      50,      60 )      35   0.659%  21.683% 
[      60,      70 )       1   0.019%  21.701% 
[      80,      90 )      74   1.393%  23.094% 
[      90,     100 )     197   3.708%  26.802% #
[     100,     120 )     167   3.143%  29.945% #
[     120,     140 )     116   2.183%  32.129% 
[     140,     160 )      61   1.148%  33.277% 
[     160,     180 )      26   0.489%  33.766% 
[     180,     200 )      10   0.188%  33.954% 
[     200,     250 )      13   0.245%  34.199% 
[     250,     300 )       1   0.019%  34.218% 
[     400,     450 )       4   0.075%  34.293% 
[     450,     500 )       4   0.075%  34.369% 
[     500,     600 )       8   0.151%  34.519% 
[     600,     700 )       2   0.038%  34.557% 
[     700,     800 )      11   0.207%  34.764% 
[     800,     900 )      43   0.809%  35.573% 
[     900,    1000 )      90   1.694%  37.267% 
[    1000,    1200 )     222   4.178%  41.446% #
[    1200,    1400 )     152   2.861%  44.306% #
[    1400,    1600 )     815  15.340%  59.646% ###
[    1600,    1800 )      58   1.092%  60.738% 
[    1800,    2000 )      10   0.188%  60.926% 
[    2000,    2500 )      42   0.791%  61.717% 
[    2500,    3000 )    1428  26.877%  88.594% #####
[    3000,    3500 )     276   5.195%  93.789% #
[    3500,    4000 )      39   0.734%  94.523% 
[    4000,    4500 )      54   1.016%  95.539% 
[    4500,    5000 )      15   0.282%  95.822% 
[    5000,    6000 )      88   1.656%  97.478% 
[    6000,    7000 )      66   1.242%  98.720% 
[    7000,    8000 )      67   1.261%  99.981% 
[    8000,    9000 )       1   0.019% 100.000% 

----- /mnt/largespace/mris_ratio_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	313
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0