benchmark/leveldb/results/ratio/mris_ratio_ssd.2.1.log
LevelDB:    version 1.5
Date:       Sun Dec  2 22:37:51 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    2392.990 micros/op;   19.6 MB/s small: 5000/0; big: 2500/0
Microseconds per op:
Count: 7500  Average: 2393.0175  StdDev: 2562.98
Min: 0.0000  Median: 1507.4341  Max: 11351.0000
------------------------------------------------------
[       0,       1 )      14   0.187%   0.187% 
[       1,       2 )     296   3.947%   4.133% #
[       2,       3 )    2135  28.467%  32.600% ######
[       3,       4 )      42   0.560%  33.160% 
[       4,       5 )       1   0.013%  33.173% 
[      12,      14 )       1   0.013%  33.187% 
[      14,      16 )       2   0.027%  33.213% 
[      16,      18 )       2   0.027%  33.240% 
[      20,      25 )       1   0.013%  33.253% 
[      25,      30 )      15   0.200%  33.453% 
[      30,      35 )      25   0.333%  33.787% 
[      35,      40 )     103   1.373%  35.160% 
[      40,      45 )     246   3.280%  38.440% #
[      45,      50 )      16   0.213%  38.653% 
[      50,      60 )      24   0.320%  38.973% 
[      60,      70 )       1   0.013%  38.987% 
[      90,     100 )      28   0.373%  39.360% 
[     100,     120 )     120   1.600%  40.960% 
[     120,     140 )      59   0.787%  41.747% 
[     140,     160 )      21   0.280%  42.027% 
[     160,     180 )      19   0.253%  42.280% 
[     180,     200 )      12   0.160%  42.440% 
[     200,     250 )      24   0.320%  42.760% 
[     250,     300 )       6   0.080%  42.840% 
[     300,     350 )       2   0.027%  42.867% 
[     400,     450 )       2   0.027%  42.893% 
[     450,     500 )       2   0.027%  42.920% 
[     500,     600 )       9   0.120%  43.040% 
[     600,     700 )      12   0.160%  43.200% 
[     700,     800 )       9   0.120%  43.320% 
[     800,     900 )      19   0.253%  43.573% 
[     900,    1000 )      42   0.560%  44.133% 
[    1000,    1200 )     117   1.560%  45.693% 
[    1200,    1400 )      99   1.320%  47.013% 
[    1400,    1600 )     417   5.560%  52.573% #
[    1600,    1800 )      51   0.680%  53.253% 
[    1800,    2000 )       4   0.053%  53.307% 
[    2000,    2500 )      82   1.093%  54.400% 
[    2500,    3000 )     755  10.067%  64.467% ##
[    3000,    3500 )     206   2.747%  67.213% #
[    3500,    4000 )     386   5.147%  72.360% #
[    4000,    4500 )     202   2.693%  75.053% #
[    4500,    5000 )     211   2.813%  77.867% #
[    5000,    6000 )     620   8.267%  86.133% ##
[    6000,    7000 )     748   9.973%  96.107% ##
[    7000,    8000 )     230   3.067%  99.173% #
[    8000,    9000 )      60   0.800%  99.973% 
[    9000,   10000 )       1   0.013%  99.987% 
[   10000,   12000 )       1   0.013% 100.000% 

----- /mnt/largespace/mris_ratio_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	2500
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0