benchmark/leveldb/results/ratio/mris_ratio_ssd.32.1.log
LevelDB:    version 1.5
Date:       Sun Dec  2 22:40:26 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    1603.083 micros/op;    7.1 MB/s small: 5000/0; big: 157/0
Microseconds per op:
Count: 5157  Average: 1603.1206  StdDev: 1422.09
Min: 0.0000  Median: 1474.7899  Max: 8190.0000
------------------------------------------------------
[       0,       1 )       7   0.136%   0.136% 
[       1,       2 )      32   0.621%   0.756% 
[       2,       3 )      96   1.862%   2.618% 
[       3,       4 )      20   0.388%   3.006% 
[      12,      14 )       1   0.019%   3.025% 
[      16,      18 )       1   0.019%   3.044% 
[      20,      25 )      13   0.252%   3.296% 
[      25,      30 )      35   0.679%   3.975% 
[      30,      35 )      84   1.629%   5.604% 
[      35,      40 )     410   7.950%  13.554% ##
[      40,      45 )     293   5.682%  19.236% #
[      45,      50 )       6   0.116%  19.352% 
[      50,      60 )      24   0.465%  19.818% 
[      60,      70 )       4   0.078%  19.895% 
[      70,      80 )       1   0.019%  19.915% 
[      80,      90 )      80   1.551%  21.466% 
[      90,     100 )     199   3.859%  25.325% #
[     100,     120 )     174   3.374%  28.699% #
[     120,     140 )     115   2.230%  30.929% 
[     140,     160 )      60   1.163%  32.092% 
[     160,     180 )      25   0.485%  32.577% 
[     180,     200 )      18   0.349%  32.926% 
[     200,     250 )      11   0.213%  33.139% 
[     250,     300 )       1   0.019%  33.159% 
[     400,     450 )       4   0.078%  33.236% 
[     450,     500 )       5   0.097%  33.333% 
[     500,     600 )       7   0.136%  33.469% 
[     600,     700 )       1   0.019%  33.488% 
[     700,     800 )      15   0.291%  33.779% 
[     800,     900 )      42   0.814%  34.594% 
[     900,    1000 )      93   1.803%  36.397% 
[    1000,    1200 )     231   4.479%  40.876% #
[    1200,    1400 )     159   3.083%  43.960% #
[    1400,    1600 )     833  16.153%  60.112% ###
[    1600,    1800 )      61   1.183%  61.295% 
[    1800,    2000 )      12   0.233%  61.528% 
[    2000,    2500 )      42   0.814%  62.342% 
[    2500,    3000 )    1501  29.106%  91.449% ######
[    3000,    3500 )     257   4.984%  96.432% #
[    3500,    4000 )      31   0.601%  97.033% 
[    4000,    4500 )      31   0.601%  97.634% 
[    4500,    5000 )       8   0.155%  97.789% 
[    5000,    6000 )      42   0.814%  98.604% 
[    6000,    7000 )      28   0.543%  99.147% 
[    7000,    8000 )      43   0.834%  99.981% 
[    8000,    9000 )       1   0.019% 100.000% 

----- /mnt/largespace/mris_ratio_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	157
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0