benchmark/leveldb/results/ratio/mris_ratio_ssd.64.2.log
LevelDB:    version 1.5
Date:       Sun Dec  2 22:41:00 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    1564.674 micros/op;    6.2 MB/s small: 5000/0; big: 79/0
Microseconds per op:
Count: 5079  Average: 1564.7129  StdDev: 1320.15
Min: 0.0000  Median: 1474.5863  Max: 8313.0000
------------------------------------------------------
[       0,       1 )       7   0.138%   0.138% 
[       1,       2 )      16   0.315%   0.453% 
[       2,       3 )      49   0.965%   1.418% 
[       3,       4 )       7   0.138%   1.555% 
[      18,      20 )       1   0.020%   1.575% 
[      20,      25 )      13   0.256%   1.831% 
[      25,      30 )      39   0.768%   2.599% 
[      30,      35 )      89   1.752%   4.351% 
[      35,      40 )     409   8.053%  12.404% ##
[      40,      45 )     284   5.592%  17.996% #
[      45,      50 )      12   0.236%  18.232% 
[      50,      60 )      29   0.571%  18.803% 
[      60,      70 )       2   0.039%  18.842% 
[      70,      80 )       1   0.020%  18.862% 
[      80,      90 )      86   1.693%  20.555% 
[      90,     100 )     212   4.174%  24.729% #
[     100,     120 )     166   3.268%  27.998% #
[     120,     140 )     116   2.284%  30.282% 
[     140,     160 )      65   1.280%  31.561% 
[     160,     180 )      24   0.473%  32.034% 
[     180,     200 )      12   0.236%  32.270% 
[     200,     250 )      15   0.295%  32.565% 
[     250,     300 )       1   0.020%  32.585% 
[     350,     400 )       1   0.020%  32.605% 
[     400,     450 )       4   0.079%  32.684% 
[     450,     500 )       4   0.079%  32.762% 
[     500,     600 )       8   0.158%  32.920% 
[     600,     700 )       1   0.020%  32.940% 
[     700,     800 )      16   0.315%  33.255% 
[     800,     900 )      39   0.768%  34.022% 
[     900,    1000 )      94   1.851%  35.873% 
[    1000,    1200 )     233   4.588%  40.461% #
[    1200,    1400 )     169   3.327%  43.788% #
[    1400,    1600 )     846  16.657%  60.445% ###
[    1600,    1800 )      57   1.122%  61.567% 
[    1800,    2000 )       9   0.177%  61.744% 
[    2000,    2500 )      42   0.827%  62.571% 
[    2500,    3000 )    1547  30.459%  93.030% ######
[    3000,    3500 )     245   4.824%  97.854% #
[    3500,    4000 )      27   0.532%  98.386% 
[    4000,    4500 )      18   0.354%  98.740% 
[    4500,    5000 )       2   0.039%  98.779% 
[    5000,    6000 )      25   0.492%  99.272% 
[    6000,    7000 )      15   0.295%  99.567% 
[    7000,    8000 )      21   0.413%  99.980% 
[    8000,    9000 )       1   0.020% 100.000% 

----- /mnt/largespace/mris_ratio_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	79
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0